/// ----------------------------------------<summary>
/// scene管理
/// 管理者：諸田
/// </summary>----------------------------------------
#pragma once

#include "stdafx.h"

namespace basecross{

	//--------------------------------------------------------------------------------------
	///	ゲームシーン
	//--------------------------------------------------------------------------------------
	class Scene : public SceneBase{
	private:
		weak_ptr<XAudio2Manager> m_audioManager = App::GetApp()->GetXAudio2Manager();
		weak_ptr<SoundItem> m_numMusic;
		wstring dataDir;


	public:
		//--------------------------------------------------------------------------------------
		/*!
		@brief コンストラクタ
		*/
		//--------------------------------------------------------------------------------------
		Scene() :SceneBase(){}
		//--------------------------------------------------------------------------------------
		/*!
		@brief デストラクタ
		*/
		//--------------------------------------------------------------------------------------
		virtual ~Scene();
		//--------------------------------------------------------------------------------------
		/*!
		@brief 初期化
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnCreate() override;
		//--------------------------------------------------------------------------------------
		/*!
		@brief イベント取得
		@return	なし
		*/
		//--------------------------------------------------------------------------------------
		virtual void OnEvent(const shared_ptr<Event>& event) override;


		/// ----------------------------------------------------------------------------<summary>
		/// イメージの読み込み
		/// </summary>----------------------------------------------------------------------------
		void LoadImageResources();
		void LoadImageResources(wstring FileName,wstring KeyName);
		void LoadImageResources(wstring FolderName);

		/// ----------------------------------------------------------------------------<summary>
		/// スタティックモデルの読み込み
		/// </summary>----------------------------------------------------------------------------
		void LoadStaticModelResources();
		void LoadStaticModelResources(wstring FileName,wstring KeyName);

		/// ----------------------------------------------------------------------------<summary>
		/// ボーンモデルの読み込み
		/// </summary>----------------------------------------------------------------------------
		void LoadBoneModelResources();
		void LoadBoneModelResources(wstring FileName,wstring KeyName);

		/// ----------------------------------------------------------------------------<summary>
		/// マルチメッシュボーンモデルの読み込み
		/// </summary>----------------------------------------------------------------------------
		void LoadMultiMeshModelResources();

		/// ----------------------------------------------------------------------------<summary>
		/// サウンドの読み込み(引数なし)
		/// </summary>----------------------------------------------------------------------------
		void LoadSoundResources();

		/// ----------------------------------------------------------------------------<summary>
		/// サウンドを単発再生
		/// </summary>----------------------------------------------------------------------------
		shared_ptr<SoundItem> MusicOnceStart(wstring key,float volume);

		/// ----------------------------------------------------------------------------<summary>
		/// サウンドをループ再生
		/// </summary>----------------------------------------------------------------------------
		shared_ptr<SoundItem> MusicRoopStart(wstring key,float volume);
	};

}

//end basecross
